// Задача №0. Напишите программу, которая  на вход принимает число и выдает его квадрат.
// Например:
// 4 -> 16; -3-> 9;-7 -> 49

System.Console.WriteLine("Введите число: ");
// string s = Console.ReadLine()!;
int num = int.Parse(Console.ReadLine()!);

Console.WriteLine(num * num);

